n5/src/DataProcessors/CreateTenant/CreateTenant.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CreateTenant</name>
</mdclass:DataProcessor>

n5/src/Enums/ExchangeTypes/ExchangeTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangeTypes</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>FTP</name>
  </enumValues>
  <enumValues>
    <name>NetworkDisk</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/ExchangePeriodicity/ExchangePeriodicity.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangePeriodicity</name>
  <enumValues>
    <name>Daily</name>
  </enumValues>
  <enumValues>
    <name>Weekly</name>
  </enumValues>
  <enumValues>
    <name>Monthly</name>
  </enumValues>
  <enumValues>
    <name>Quarterly</name>
  </enumValues>
  <enumValues>
    <name>Yearly</name>
  </enumValues>
  <enumValues>
    <name>Constant</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/ExchangeRules/ExchangeRules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangeRules</name>
  <enumValues>
    <name>None</name>
  </enumValues>
  <enumValues>
    <name>File</name>
  </enumValues>
  <enumValues>
    <name>Database</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/Access/Access.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Access</name>
  <enumValues>
    <name>Undefined</name>
  </enumValues>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Forbid</name>
  </enumValues>
  <enumValues>
    <name>States</name>
  </enumValues>
  <enumValues>
    <name>Directly</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Tenants/Tenants.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Tenants</name>
  <attributes>
    <name>AgentTenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Deactivated</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EndOfTrialPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PromoCode</name>
    <type>
      <types>CatalogRef.PromoCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/PromoCodes/PromoCodes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>PromoCodes</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentTenant</name>
    <type>
      <types>CatalogRef.Tenants</types>
    </type>
  </attributes>
  <attributes>
    <name>Bonus</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DiscountPeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpirationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssueDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Catalogs/Exchange/Exchange.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Exchange</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>EMailLoad</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>EMailUnLoad</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>FileMessage</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>FileRules</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FileRulesClassifiers</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskLoadHandle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskLoadScheduledJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskUnLoadHandle</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderDiskUnLoadJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPClient</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPClientJob</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FolderFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InformationRules</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>InformationRulesClassifiers</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>LastDateLoad</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastDateUnload</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>LastExchange</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>MaximumErrors</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Node</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </attributes>
  <attributes>
    <name>NumbersOfErrors</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OperationType</name>
    <type>
      <types>EnumRef.ExchangeTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>PasswordEmail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PasswordWebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Periodicity</name>
    <type>
      <types>EnumRef.ExchangePeriodicity</types>
    </type>
  </attributes>
  <attributes>
    <name>PortFTPLoad</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortFTPUnLoad</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortPOP3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PortSMTP</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PrefixFileName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegisterInSequenceCost</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Rules</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>RulesClassifiers</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>SendedEMailError</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SendEMailErrors</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ServerFTPLoad</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ServerFTPUnLoad</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ServerPOP3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServerTimeOut</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UpdateConfiguration</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseAutomatic</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseClassifiers</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UserEmail</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>UserFTPLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserFTPUnLoad</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UserTenant</name>
    <type>
      <types>CatalogRef.Users</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseRules</name>
    <type>
      <types>EnumRef.ExchangeRules</types>
    </type>
  </attributes>
  <attributes>
    <name>UseRulesClassifiers</name>
    <type>
      <types>EnumRef.ExchangeRules</types>
    </type>
  </attributes>
  <attributes>
    <name>UserWebService</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseSSL</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseStandartFTPClient</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WebService</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Receivers</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Catalogs/Logins/Logins.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Logins</name>
  <attributes>
    <name>MustChangePassword</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TenantAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Tenants</name>
    <attributes>
      <name>Tenant</name>
      <type>
        <types>CatalogRef.Tenants</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/DataProcessors/CreateTenant/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Parameters export;
var JobKey export;
var Outside;
var Error;

Function Enroll () export

	result = new Structure ( "Tenant, Error" );
	if ( findTenant () <> undefined ) then
		result.Error = "TenantAlreadyExists";
		return result;
	endif; 
	BeginTransaction ();
	if ( IsBlankString ( Parameters.PromoCode ) ) then
		promoCode = undefined;
	else
		promoCode = getPromoCode ();
		if ( promoCode = undefined ) then
			result.Error = "PromoCodeError";
			return result;
		endif; 
		if ( not checkPromoCode ( promoCode ) ) then
			result.Error = "PromoCodeError";
			return result;
		endif; 
	endif;
	tenant = newTenant ( promoCode );
	activateTenant ( tenant.Ref );
	createMasterNode ();
	createSlaveNode ( tenant );
	createExchangeUser ( tenant );
	if ( not loadInitialData () ) then
		raise Error;
	endif;
	InitializePredefinedData ();
	setAdministrativeUser ();
	setCompany ( Parameters );
	setFirstStart ();
	CommitTransaction ();
	result.Tenant = tenant.Code;
	return result;

EndFunction

Function findTenant ()
	
	s = "
	|select top 1 Tenants.Ref as Ref
	|from Catalog.Tenants as Tenants
	|where Tenants.Description = &Email
	|";
	q = new Query ( s );
	q.SetParameter ( "Email", Parameters.Email );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ].Ref );
	
EndFunction 

Function getPromoCode ()
	
	s = "
	|select PromoCodes.Ref as Ref
	|from Catalog.PromoCodes as PromoCodes
	|where not PromoCodes.DeletionMark
	|and not PromoCodes.IsFolder
	|and PromoCodes.Code = &PromoCode
	|";
	q = new Query ( s );
	q.SetParameter ( "PromoCode", Parameters.PromoCode  );
	table = q.Execute ().Unload ();
	return ? ( table.Count () = 0, undefined, table [ 0 ].Ref );

EndFunction 

Function checkPromoCode ( PromoCode )
	
	blockPromoCode ( PromoCode );
	fields = DF.Values ( PromoCode, "ExpirationDate, Finish" );
	if ( fields.ExpirationDate < CurrentSessionDate () ) then
		return false;
	endif; 
	alreadyActivated = fields.Finish <> Date ( 1, 1, 1 );
	if ( alreadyActivated ) then
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure blockPromoCode ( PromoCode )
	
	lock = new DataLock ();
	item = lock.Add ( "Catalog.PromoCodes" );
	item.Mode = DataLockMode.Exclusive;
	item.SetValue ( "Ref", PromoCode );
	lock.Lock ();
	
EndProcedure 

Function newTenant ( PromoCode )
	
	lockTenants ();
	tenantCode = getNewTenantCode ();
	obj = Catalogs.Tenants.CreateItem ();
	obj.Code = tenantCode;
	if ( PromoCode <> undefined ) then
		obj.PromoCode = PromoCode;
		obj.AgentTenant = DF.Pick ( PromoCode, "Agent.Tenant" );
	endif; 
	obj.Description = Parameters.Email;
	obj.RegistrationDate = CurrentSessionDate ();
	obj.EndOfTrialPeriod = obj.RegistrationDate + Constants.TrialPeriod.Get () * 86400;
	obj.Write ();
	return obj;
	
EndFunction 

Procedure lockTenants ()

	lock = new DataLock ();
	item = lock.Add ( "Catalog.Tenants" );
	item.Mode = DataLockMode.Exclusive;
	lock.Lock ();
	
EndProcedure

Function getNewTenantCode ()
	
	for i = 0 to 15 do
		code = generateCode ();
		tenant = Catalogs.Tenants.FindByCode ( code );
		if ( tenant.IsEmpty () ) then
			return code;
		endif; 
	enddo; 
	raise Output.CantCreateTenantCode ();
	
EndFunction 

Function generateCode ()
	
	return Upper ( StrReplace ( Left ( "" + new UUID (), 11 ), "-", "" ) );
	
EndFunction 

Procedure activateTenant ( Tenant )
	
	SessionParameters.Tenant = Tenant;
	SessionParameters.TenantUse = true;

EndProcedure 

Procedure createMasterNode ()
	
	code = getCode ( 1, Metadata.ExchangePlans.MobileServers );
	name = "This Node";
	node = ExchangePlans.MobileServers.ThisNode ().GetObject ();
	node.Code = code;
	node.Description = name;
	node.Write ();
	obj = Catalogs.Exchange.CreateItem ();
	obj.Description = name;
	obj.Code = code;
	obj.Node = node.Ref;
	obj.Write ();
	
EndProcedure 

Function getCode ( Code, Plan )
	
	return Format ( Code, "ND=" + Plan.CodeLength + "; NLZ=; NG=" );
	
EndFunction 

Procedure createSlaveNode ( Tenant )
	
	code = getCode ( 2, Metadata.ExchangePlans.MobileServers );
	name = "Mobile Server";
	node = ExchangePlans.MobileServers.CreateNode ();
	node.Code = code;
	node.Classifiers = getCode ( 2, Metadata.ExchangePlans.Classifiers );
 	node.Description = name;
	node.Write ();
	obj = Catalogs.Exchange.CreateItem ();
	obj.Description = name;
	obj.Code = code;
	obj.Node = node.Ref;
	obj.PrefixFileName = Tenant.Code;
	obj.OperationType = Enums.ExchangeTypes.NetworkDisk;
	obj.Periodicity = Enums.ExchangePeriodicity.Daily;
	obj.UseAutomatic = true;
	file = Constants.MobileRules.Get ();
	folder = FileSystem.GetFolder ( file );
	obj.UserTenant = Cloud.ExchangeUser ();
	obj.FolderDiskLoadHandle = folder;
	obj.FolderDiskLoadScheduledJob = folder;
	obj.FolderDiskUnLoadHandle = folder;
	obj.FolderDiskUnLoadJob = folder;
	obj.UseRules = Enums.ExchangeRules.File;
	obj.FileRules = file;
	obj.UseRulesClassifiers = Enums.ExchangeRules.File;
	obj.FileRulesClassifiers = Constants.ClassifiersRules.Get ();
	obj.Write ();
	
EndProcedure 

Procedure createExchangeUser ( Tenant )
	
	separated = LoginsSrv.Separated ();
	name = Cloud.ExchangeUser ();
	if ( separated
		or InfoBaseUsers.FindByName ( name ) = undefined ) then
		name = Cloud.ExchangeUser ();
		if ( name = "" ) then
			name = "_exchange";
		endif;
		user = InfoBaseUsers.CreateUser ();
		user.Name = name;
		User.Password = Constants.ExchangePassword.Get ();
		user.FullName = name;
		if ( separated ) then
			user.DataSeparation.Insert ( "Tenant", Tenant.Code );
		endif;
		languages = Metadata.Languages;
		english = languages.Find ( "English" );
		user.Language = ? ( english = undefined, languages.Russian, english );
		user.ShowInList = false;
		user.Roles.Add ( Metadata.Roles.Exchange );
		user.Write ();
	endif;
	
EndProcedure

Function loadInitialData ()
	
	loadXML = DataProcessors.Exchange.Create ();
	file = Constants.Initdb.Get ();
	if ( file = "" ) then
		cleanFile = true;
		file = GetTempFileName ();
		DataProcessors.CreateTenant.GetTemplate ( "Init" ).Write ( file );
	else
		cleanFile = false;
	endif;
	loadXML.ИмяФайлаОбмена = file; 
	loadXML.РежимОбмена = "Загрузка";
	loadXML.НеВыводитьНикакихИнформационныхСообщенийПользователю = true;
	ok = true;
	try
		loadXML.ВыполнитьЗагрузку ();
	except
		Error = BriefErrorDescription ( ErrorInfo () );
		ok = false;
	endtry;
	if ( cleanFile ) then
		DeleteFiles ( file );
	endif;
	return ok;
	
EndFunction 

Procedure setAdministrativeUser ()
	
	selection = Catalogs.Users.Select ();
	selection.Next ();
	user = selection.GetObject ();
	userName = Parameters.User;
	user.Description = userName;
	user.FirstName = userName;
	creator = Parameters.Creator;
	if ( creator = undefined ) then
		user.Email = Parameters.Email;
		user.Language = Parameters.Language;
		user.Protection = Parameters.Protection;
		user.OSAuth = Parameters.OSAuth;
		user.OSUser = Parameters.OSUser;
		user.Show = Parameters.Show;
		user.Login = newLogin ();
		setAdministrativeEmployee ( Parameters, user );
		user.AdditionalProperties.Insert ( "Password", Parameters.Password );
	else
		updateLogin ();
		user.Login = creator;
	endif;
	user.Code = Conversion.DescriptionToCode ( userName );
	user.Write ();
	Constants.MainUser.Set ( user.Ref );
	
EndProcedure

Function newLogin ()

	login = Catalogs.Logins.CreateItem ();
	login.Description = Parameters.User;
	login.TenantAccess = Enums.Access.Allow;
	row = login.Tenants.Add ();
	row.Tenant = SessionParameters.Tenant;
	login.Write ();
	return login.Ref;

EndFunction

Procedure setAdministrativeEmployee ( Params, User )
	
	employee = User.Employee.GetObject ();
	employee.Description = Params.User;
	employee.FirstName = Params.User;
	employee.Email = Params.Email;
	employee.Write ();
	
EndProcedure

Procedure updateLogin ()
	
	creator = Parameters.Creator;
	access = DF.Pick ( creator, "TenantAccess" );
	hasEverything = access <> Enums.Access.Allow; 
	if ( hasEverything ) then
		return;
	endif;
	obj = creator.GetObject ();
	row = obj.Tenants.Add ();
	row.Tenant = SessionParameters.Tenant;
	obj.Write ();
	
EndProcedure

Procedure setCompany ( Params )
	
	selection = Catalogs.Companies.Select ();
	selection.Next ();
	obj = selection.GetObject ();
	obj.Description = Params.Company;
	obj.FullDescription = Params.Company;
	obj.Write ();
	Constants.Company.Set ( obj.Ref );
	
EndProcedure 

Procedure setFirstStart ()
	
	Constants.FirstStart.Set ( true );
	
EndProcedure 

Procedure Exec () export

	BeginTransaction ();
	oldTenant = SessionParameters.Tenant;
	tenant = newOrganization ();
	if ( tenant = undefined ) then
		RollbackTransaction ();
		sendError ();
		return;
	endif;
	users = getUsers ();
	tenantRef = tenant.Ref;
	try
		activateTenant ( tenantRef );
	except
		Error = BriefErrorDescription ( ErrorInfo () );
		RollbackTransaction ();
		sendError ();
		return;
	endtry;
	createMasterNode ();
	createSlaveNode ( tenant );
	createExchangeUser ( tenant );
	if ( not loadInitialData () ) then
		RollbackTransaction ();
		return;
	endif;
	InitializePredefinedData ();
	setAdministrativeUser ();
	setCompany ( Parameters );
	setFirstStart ();
	activateTenant ( oldTenant );
	if ( not assignUsers ( users ) ) then
		RollbackTransaction ();
		return;
	endif;
	CommitTransaction ();
	PutToTempStorage ( tenantRef, Parameters.Result );

EndProcedure

Procedure sendError ()
	
	Progress.Put ( Error, JobKey, true );
	
EndProcedure

Function newOrganization ()
	
	try
		tenantCode = getNewTenantCode ();
	except
		Error = BriefErrorDescription ( ErrorInfo () );
		return undefined;
	endtry;
	lockTenants ();
	obj = Catalogs.Tenants.CreateItem ();
	obj.Code = tenantCode;
	obj.Description = Parameters.Company;
	obj.RegistrationDate = CurrentSessionDate ();
	obj.Write ();
	return obj;
	
EndFunction

Function getUsers ()

	s = "select Users.Ref as User
	|from Catalog.Users as Users
	|where not Users.DeletionMark
	|and not Users.AccessDenied
	|and not Users.AccessRevoked
	|and Users.Login.TenantAccess in (
	|	value ( Enum.Access.Undefined ),
	|	value ( Enum.Access.Forbid )
	|)
	|union
	|select Ref from Catalog.Users where Login = &Creator";
	q = new Query ( s );
	q.SetParameter ( "Creator", Parameters.Creator );
	return q.Execute ().Unload ().UnloadColumn ( "User" );

EndFunction

Function assignUsers ( Users )
	
	p = DataProcessors.SyncUsers.GetParams ();
	for each user in Users do
		p.User = user;
		if ( not DataProcessors.SyncUsers.Perform ( p, JobKey ) ) then
			return false;
		endif;
	enddo;
	return true;
	
EndFunction

#endif
